[{"title":"","date":"2017-07-24T10:06:03.000Z","path":"2017/07/24/机器学习小白之路 （一）机器学习各项相关宏观知识综述/","text":"机器学习小白之路 （一）机器学习各项相关宏观知识综述大数据、人工智能、机器学习、数据挖掘、神经网络、深度学习等名词的释义及辨析在本文中，我主要分享一下我对机器学习一些宏观的看待，这些是我学习中的一点心得，不一定完全准确，如果有有问题的部分，欢迎大家进行批判指正。 1、人工智能、机器学习和神经网络的关系这三个词是依次包含的关系，具体方式为：人工智能的概念最大，它包含机器学习；机器学习的概念次之，它包含神经网络。人工智能是近几年兴起的概念，主要是指可以利用数据、及相关的一些算法技术，使机器产生对人的行为的模拟(个人理解，不一定准确)。人工智能技术包括机器学习、自然语言处理、语音识别、图像处理、模式识别等许多技术，它们互相之间既有连续又有区别。不过可以看到，机器学习不可能等同于人工智能，它只是人工智能的一部分，或者说是人工智能技术的一个重要理论工具。机器学习技术主要是指一系列的算法，这些算法可以通过对已知数据的分析和建模，对未知数据的某些行为作出指导。例如，我可以通过统计1000个男性和女性的身高，并对其分别建模。此后再给出一个人的身高体重数据，我可以通过已有的模型推测他大概是男性还是女性。机器学习包括许多技术，主要分为三个分支，即监督学习、非监督学习和增强学习。有学者曾经评出了“十大最经典的机器学习算法”，有兴趣的读者可以自行百度。机器学习包含多种算法，例如决策树、支持向量机、朴素贝叶斯等。而神经网络也是诸多机器学习算法中的一种。近几年，神经网络算法大火。然而，它并不是一个近期才发展起来的算法。很早就有了神经网络算法，它也曾经火过一段时间，然而，就像很多主播或网红一样，没过多久，它就过气了。它过气主要是因为当时它的未知参数过多导致计算量过大，而且它是一个“黑盒子”模型。因此，当时又出现了“人美声甜”的“支持向量机”算法，理论优美漂亮，参数可调可控，一举便占领了神经网络的宝座，抢走了神经网络的风头。然而风水轮流转，近些年也正是因为大数据技术的发展，计算能力得到了提高，由神经网络演变而来的深度学习技术成为了主导。深度学习技术也确实在图像、视觉、自然语言等方面发挥了它强大的实力。之前的AlphaGo模型就是采用了深度学习技术，让我们看到了机器智能化的潜力。因此神经网络又一举夺回当年的桂冠，成为了时下最炙手可热的算法。 2、机器学习与数据挖掘的关系要说机器学习和数据挖掘，其实他俩的区别真心不算特别大。很多书或教材也会把它们叫混，这倒也不是因为写东西的人不知道它们的区别，而实在是它们的区别不大，没必要那么强调它们的不同。要说起区分，机器学习比数据挖掘的概念要窄。我认为有如下公式。数据挖掘=机器学习+数据处理技术机器学习主要是一系列的算法理论，它是理论上的东西，强调各种算法的联系和区别、算法的优化等。而数据挖掘主要是强调工程上的东西，如如何获取到数据、如何存储这些数据、如何清洗这些数据、如何提取合适的特征、如何选用合适的机器学习算法及合适的参数、如何评估等。 3、神经网络与深度学习的关系深度学习是神经网络的一种，又称为“深度神经网络”。言外之意，神经网络还有“浅层的”，那种就只是神经网络，不是深度学习。神经网络的参数量巨大，深度学习更是动辄几百上千个参数，数据量的增多、计算能力的增强为深度学习开辟了土壤，在近几年大放异彩。 4、大数据与其他名词的关系我个人觉得，大数据这个词和前面的这些词并不是在描述同一个东西，或者它们看问题的切入点不一样。其他词语更在于“智能”和“挖掘”两个方面，而大数据的侧重点在它的“大”上。这个“大”可以是没有智能相关技术的大。例如，它可以仅是大的数据量、大的速度、大的存储，大的计算能力。但不可否认的是，正是因为大的数据，我们才能更好地从数据中挖掘信息，才有了今天的人工智能、深度学习等技术的飞黄腾达。我认为，大数据和人工智能更像是一个人的两条腿，是一个互相支持，互相促进的关系。","tags":[]},{"title":"","date":"2017-07-24T09:30:52.000Z","path":"2017/07/24/机器学习小白之路 （二）机器学习各项相关宏观知识综述/","text":"机器学习小白之路 （二）机器学习各项相关宏观知识综述各项技术的基本涵盖点和主要技术1、大数据技术前面已经多次提到了，大数据技术主要包括大数据的获取、存储、处理等。其相关核心技术包括：1、大数据的获取目前主要来源于大型互联网公司的数据、大量移动端数据、传感器数据等。同时大量的网页中包含许多非结构化数据，如淘宝图片、淘宝评论、微博评论等，这些数据需要通过爬虫获取。2、大数据的存储不同于一般数据的存储。一般数据可以存储在关系型数据库里，而大数据由于数量巨大，往往很难用一台机器的数据库进行存储，因此可以存储在分布式数据库里。另外，由于大量非结构化数据的存在，这些数据需要存储在非关系型数据库里。3、大数据的计算需要很强的计算能力，在早年只有CPU的时候，执行一些大运算量的计算是很艰难的。现在有了GPU，GPU用它的矩阵操作能力和大带宽为高计算量打开了新的大门。现在硬件技术还在继续发展，google开放的TPU据说比GPU还要快上25倍。总之无论如何，人们对大数据量技术的硬件技术探索不会停止。4、提到大数据，不得不提的就是大数据框架。目前比较主流的几个大数据框架包括hadoop、spark和storm。其中，hadoop可以说是最为经典也是最被人广泛使用的框架。它的前身是google提出的“三架马车”，GFS，MapReduce和Bigtable。现在hadoop已经成为了一个拥有完整生态系统的架构。然而hadoop也有它固有的缺点。比如，它的计算模式只有map和reduce两种，不够灵活；计算速度慢等。Spark的出现改善了这种情况，Spark采用内存计算机制，使计算更快，并设计了多种RDD，有多种操作。同时Spark生态系统中还综合了流处理、图计算等技术，使其成为了更加炙手可热的分布式框架。Storm主要用于流处理，近几年没那么火了，所以不说了。 2、机器学习技术机器学习是一系列算法的合称，这些算法均可以帮助我们从一群数据中挖掘出想要的信息。机器学习算法的分类有不同的指标，比较常见的是将机器学习算法分为监督学习、非监督学习和增强学习三个大类。1、监督学习：机器学习算法中最庞大的一个分支，拥有众多经典算法。监督学习需要训练数据，通过训练数据可以训练出一个模型。将新的数据放入训练出的模型后就能得到预测的结果。比较经典的监督学习算法包括决策树、支持向量机、朴素贝叶斯、逻辑斯蒂回归等。2、非监督学习，非监督学习不需要训练数据和训练过程，它利用已有数据自身的性质将它们天然地分成多类。常用的非监督学习主要是各种聚类算法，如K-means聚类、谱聚类、密度聚类、层次聚类等。3、增强学习：增强学习需要将训练的结果对训练过程做出反馈。如果训练结果是好的就给正反馈，如果训练结果不好就给负反馈。以此来不断调整学习的策略。 3、数据挖掘技术谈到数据挖掘技术，我主要想谈一谈数据分析技术。数据分析技术包括一个基本流程，这个流程如下所示：1、业务分析2、数据采集3、数据预处理4、数据建模5、模型评估6、结果可视化以上6步是一个完整的数据分析流程。其中，业务分析和数据采集是分析的准备阶段；数据预处理是数据分析的基础，它的目的是将采集回来的原始数据清洗、转换成为可以直接拿来建模的数据。例如，采回来的的数据中可能会有一些缺失数据、而且采集数据可能过于稀疏等，这些都需要进行变换。同时，特征工程也是数据预处理中至关重要的步骤。数据往往有诸多特征，这些特征也许并不是全都有用的。有很多冗余。有些特征甚至对数据还有负的影响作用。这些特征都需要特征工程去处理。数据建模就是将预处理好的数据用各种机器学习算法进行训练，得到训练模型。得到模型后，在模型评估阶段，我们将用测试数据对模型进行评估，常用的评估方法是k-折交叉验证法，常用的指标包括precision、recall、F-value等。最后的可视化主要是对结果的一个对外交互。属于比较上层的部分。","tags":[]},{"title":"","date":"2017-07-24T09:30:05.000Z","path":"2017/07/24/机器学习小白之路（序）———谈谈入坑和入坑后的感想/","text":"机器学习小白之路（序）———谈谈入坑和入坑后的感想一、我是如何入坑的我在读本科的时候对“机器学习”、“人工智能”等名词是完全没有概念的。当时读的是电子信息工程专业，每天主要就是和各种信号处理机制、滤波器、调制解调器等打交道，当时一心想读一个通信领域或信号领域的研究生，为国家的通讯事业奉献一生。然而一个偶然，读研期间选择了一个以“大数据”为主要研究方向的导师，自此生活便走上了与数据相关的道路，和信号处理那些东西就不在有什么关系了。记得我刚考上研究生的时候，对“大数据”毛线都不懂。然后就被导师要求写一篇关于大数据的综述调研。我硬着头皮鏖战了好几天，最终写出了一个以hadoop框架和spark框架为主的四不像的东西。最后导师看了估计心里暗暗叹了口气，然后这件事就没有然后了。但是在这次没什么技术含量的调研当中，我还是大致初窥了大数据领域的全貌。我大概了解到，大数据技术之所以在近期倍广泛的提出，主要是由于移动互联网和物联网的普及产生了大量数据，并且我们有了越来越强大的存储资源和计算资源。在有了数据，又有了处理数据的能力之后，我们便产生了从这些数据中挖掘信息的想法。因此也催生了大数据的一系列相关技术。大数据技术主要包括以下一些方面：大数据获取、大数据存储、大数据并行计算、大数据清洗处理、大数据中的数据挖掘、机器学习、结果可视化等。其中，大数据的数据挖掘和机器学习技术应该算是大数据各项技术中较为核心且更偏重于理论和算法等技术。它们也是从数据中挖掘信息的关键技术。可以说，无论是存储技术还是计算能力的提升，都是为通过机器学习等技术挖掘信息作准备工作的。因此，当时的我就对数据挖掘和机器学习技术有了较深的印象。比较严肃的扯了一堆，以上说的基本都是废话，真正使我入坑的原因是我是个臭美的妹子而在我苦恼淘宝找不到合适我的好看衣服时我猛然发现机器学习就是干这个的。于是我就入坑了，然后就没有然后了。 二、谈谈我的感想入坑后我就开始搜集各方面的资料，并寻找一些机会来学习机器学习的相关知识。当时主要是上了一些数据挖掘相关的课程，当时用的是R语言，跟着老师做了一些比较简单的手写数字识别、文理科分类、简单预测任务等。这个学科刚开始学的时候有一种越学越有趣的感觉。因为机器学习真的可以做好多有趣的事情，比如可以预测下一个季度的流行歌手，预测一场球赛的胜利、预测股市的涨跌等。虽然很多尝试仅仅可以用在实验中，比如预测股市的涨跌，如果你真的相信你训练的模型，搞不好会血本无归。但是这种憧憬是好的，学习机器学习的动力充足无比，好像学完了我就可以预测未来拯救地球一样。在简单学习了一些基础算法使用和R语言之后，我又开始学一些算法深层的东西，比如SVM的算法原理、决策树、朴素贝叶斯的算法原理等。从数学层面渐渐了解了更多的机器学习算法。学习的期间主要还看了一些书，比如李航的《统计学习方法》、周志华的《机器学习》等，这两本书写的真的很好，让我看到了所谓的大家风范。读书期间，慢慢领悟到，机器学习不仅仅是几个算法、几个任务，它更是一个需要综合多种领域知识的非常集大成的技术群。慢慢地也感受到了这个领域存在的竞争和难点。现在的我虽然还是一个小白，但对机器学习也有了一些更深的认识。最近也快要找工作了，发现大多数的机器学习岗位其实并不想一开始学习时想象的那么有趣。在工作中，可能有70%的时间是在“清洗数据”，也就是在乱七八糟数据中“捡垃圾”，挑出那些不能用的、对结果有负影响的数据；90%的时间在调参数，也就是把程序都写好了，然后用一个参数跑一遍，不好了换个参数再跑一遍。这些过程都是比较无聊的。那么高大上的算法部分去哪了呢？一般在程序中，那些著名的算法都被封装好了，用起来仅仅是一句话而已。以上就是我对机器学习领域对入坑到现在的一个整体认识。你说它神奇，它没那么神奇。你不可能学习它就去拯救地球，改变世界，成为下一个巴菲特，很多时候，你发现给你一堆数据让你分个男女你都只能得到70%左右的准确率；另一方面，你说它枯燥无聊，而它确实在慢慢改变这个世界。AlphaGo、无人车、增强现实等技术无一不是基于它的基础理论。因此对于机器学习，应该洗尽铅华，辩证的看待，毕竟它到底有没有用，还是要看你是不是大牛而已。","tags":[]}]